import matplotlib.pyplot as plt

# Пример данных (замените на реальные замеры)
processes = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
times1 = [0.0120, 0.0094, 0.0117, 0.0124, 0.0119, 0.0156, 0.0263, 0.0192, 1.0083, 1.5738, 1.9488, 2.5373, 3.2209, 3.0798, 2.9274]   # 100x100 с шагом 100 ("Малое число шагов, маленькая карта")
times2 = [3.3856, 3.5010, 2.0272, 1.6884, 2.0711, 2.1300, 1.8123, 1.9408, 2.8488, 3.2068, 3.9737, 4.5578, 4.6119, 5.3335, 5.9746]   # 1000x1000 с шагом 100 ("Малое число шагов, большая карта")
times3 = [0.2514, 0.1171, 0.1070, 0.1938, 0.2109, 0.3484, 0.4651, 1.9169, 13.5683, 20.7798, 30.6827, 36.0133, 37.8872, 39.5556, 38.7887]   # 100x100 с шагом 1000 ("Большое число шагов, маленькая карта")
times4 = [12.9684, 8.5079, 6.7184, 18.6883, 15.5074, 15.7574, 18.0282, 18.5985, 22.8977, 37.7088, 37.4691, 34.2011, 41.6820, 42.8921, 40.5313]  # 1000x1000 с шагом 1000 ("Большое число шагов, большая карта")

speedup = [times4[0] / t for t in times4]
efficiency = [s / p for s, p in zip(speedup, processes)]

plt.plot(processes, speedup, 'o-', label='Ускорение')
plt.plot(processes, efficiency, 's-', label='Эффективность')
plt.xlabel('Количество процессов')
plt.legend()
plt.grid()
plt.show()